# Regiment

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Step 2. Create the DataFrame with the following values:

In [4]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [6]:
reg = pd.DataFrame(data=raw_data, columns=raw_data.keys())
reg.head()

     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
4    Dragoons     1st     Cooze             3             70

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [8]:
reg.groupby('regiment').mean().loc['Nighthawks', 'preTestScore']

15.25

### Step 5. Present general statistics by company

In [14]:
desc_df = reg.groupby('company').describe().T.unstack(0)
desc_df

company          1st                        2nd
        preTestScore postTestScore preTestScore postTestScore
count       6.000000      6.000000     6.000000      6.000000
mean        6.666667     57.666667    15.500000     67.000000
std         8.524475     27.485754    14.652645     14.057027
min         2.000000     25.000000     2.000000     57.000000
25%         3.000000     34.250000     2.250000     58.250000
50%         3.500000     66.000000    13.500000     62.000000
75%         4.000000     70.000000    29.250000     68.000000
max        24.000000     94.000000    31.000000     94.000000

### Step 6. What is the mean of each company's preTestScore?

In [20]:
desc_df.loc['mean'].unstack()['preTestScore']

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

### Step 7. Present the mean preTestScores grouped by regiment and company

In [26]:
reg.groupby(['regiment', 'company']).mean()['preTestScore']

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [25]:
reg.groupby(['regiment', 'company']).mean()['preTestScore'].unstack().T

regiment  Dragoons  Nighthawks  Scouts
company
1st            3.5        14.0     2.5
2nd           27.5        16.5     2.5

### Step 9. Group the entire dataframe by regiment and company

In [28]:
gb = reg.groupby(['regiment', 'company'])

### Step 10. What is the number of observations in each regiment and company

In [29]:
gb.count()

                    name  preTestScore  postTestScore
regiment   company
Dragoons   1st         2             2              2
           2nd         2             2              2
Nighthawks 1st         2             2              2
           2nd         2             2              2
Scouts     1st         2             2              2
           2nd         2             2              2

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [100]:
# -> group('Nighthawks', '2nd')
print("Group: ", list(gb.groups.items())[3][0]) # name of the group
print("Indexes: ", list(gb.groups.items())[3][1]) # list of corresponding indexes

gb.get_group(('Nighthawks', '2nd'))

Group:  ('Nighthawks', '2nd')
Indexes:  Int64Index([2, 3], dtype='int64')

     regiment company    name  preTestScore  postTestScore
2  Nighthawks     2nd     Ali            31             57
3  Nighthawks     2nd  Milner             2             62

In [163]:
for i,j in gb.groups.items():
    print(reg.loc[j])
# print(list(zip(*gb.groups.items()))[1])

   regiment company   name  preTestScore  postTestScore
4  Dragoons     1st  Cooze             3             70
5  Dragoons     1st  Jacon             4             25
   regiment company    name  preTestScore  postTestScore
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
     regiment company    name  preTestScore  postTestScore
2  Nighthawks     2nd     Ali            31             57
3  Nighthawks     2nd  Milner             2             62
  regiment company   name  preTestScore  postTestScore
8   Scouts     1st  Sloan             2             62
9   Scouts     1st  Piger             3             70
   regiment company   name  preTestScore  postTestScore
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70

In [138]:
for gr in gb.groups:
    print(gb.get_group(gr), end='\n'+60*'.'+'\n')
#     print(gr)

   regiment company   name  preTestScore  postTestScore
4  Dragoons     1st  Cooze             3             70
5  Dragoons     1st  Jacon             4             25
............................................................
   regiment company    name  preTestScore  postTestScore
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
............................................................
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
............................................................
     regiment company    name  preTestScore  postTestScore
2  Nighthawks     2nd     Ali            31             57
3  Nighthawks     2nd  Milner             2             62
............................................................
  regiment company   name  preTestScore  postTestScore
8   Scouts     1st  Sloan             2             62
9   Scouts     1st  Piger             3             70
............................................................
   regiment company   name  preTestScore  postTestScore
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70
............................................................

In [168]:
for n,gr in gb:
    print('\n'+str(n), end='\n'+60*'.'+'\n')
    print(gr)

('Dragoons', '1st')
............................................................
   regiment company   name  preTestScore  postTestScore
4  Dragoons     1st  Cooze             3             70
5  Dragoons     1st  Jacon             4             25

('Dragoons', '2nd')
............................................................
   regiment company    name  preTestScore  postTestScore
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57

('Nighthawks', '1st')
............................................................
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94

('Nighthawks', '2nd')
............................................................
     regiment company    name  preTestScore  postTestScore
2  Nighthawks     2nd     Ali            31             57
3  Nighthawks     2nd  Milner             2             62

('Scouts', '1st')
............................................................
  regiment company   name  preTestScore  postTestScore
8   Scouts     1st  Sloan             2             62
9   Scouts     1st  Piger             3             70

('Scouts', '2nd')
............................................................
   regiment company   name  preTestScore  postTestScore
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70

In [124]:
for ind in gb.indices:
    print(ind, end='\n'+60*'.'+'\n')

('Dragoons', '1st')
............................................................
('Dragoons', '2nd')
............................................................
('Nighthawks', '1st')
............................................................
('Nighthawks', '2nd')
............................................................
('Scouts', '1st')
............................................................
('Scouts', '2nd')
............................................................